10/data/attachments/35b7ce55fea357f1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>John_major_Friend_89531_6</nif:username>
            <nif:friendToBeRequested>soap_friends_d439e020-d2e4-47bd-9aac-ecc0b42b9abd</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>